#include "Windows.h"  
#include "stdio.h"
#include "stdlib.h" 
#include "math.h"

#include "vector"
#include "algorithm"
using namespace std;

#include "ynMath.h"

#define GLYMATH_VERSION  "2010.10.10"




///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
//
// struct COLOR
//
///////////////////////////////////////////////////////////////////////////////

//
//! 생성자 오버로딩.
//!
//! BYTE(r, g, b, a) -> float (r, g, b, a)
// 
/*B3YXCOLOR::B3YXCOLOR(BYTE _r, BYTE _g, BYTE _b, BYTE _a)
{
	b = _b/255.0f;					//실수형으로 전환.  0~ 1.0f
	g = _g/255.0f;
	r = _r/255.0f;
	a = _a/255.0f;
}
*/

//! DWORD 형 색상에서 float 타입으로 색상정보를 전환합니다.★
//! DWORD(a, r, g, b) --> float(r, g, b, a) 로 전환. (GDI용)  
//!   0x AA RR GG BB 
//! 각 채널별 시작 비트..
//! Blue 채널: 0번비트  
//! Gree 채널: 8번비트 
//! Red  채널: 16번비트 
//! Alpha 채널: 24번비트
//
B3YXCOLOR::B3YXCOLOR(DWORD col)
{
	// 필요 코드를 완성하십시요.
	//
	//<Blue> 변환.★
	b = (float)(col & 0x00'00'00'ff);		//정수형.blue 채널값 얻기.  0 ~ 255
	b /= 255.0f;						//여기서 다시 실수형으로 전환.  0~ 1.0f 
	
	//<Green> 변환.★
	g = (float)((col & 0x00'00'ff'00) >> 8);
	g /= 255.0f;

	//<Red> 변환.★
	r = (float)((col & 0x00'ff'00'00) >> 16);
	r /= 255.0f;

	//<Alpha> 변환.★
	a = (float)((col & 0xff'00'00'00) >> 24);
	a /= 255.0f;
}




// 
//! 색상 연산 오버로딩..★
//!
//! 모든 연산에 색상 포화도(Saturation) 제한을 처리합니다.
//! 0 ~ 1.0f ( 0~ 255)
//
 
//! 색상 채널별 곱셈.  
B3YXCOLOR B3YXCOLOR::operator * (B3YXCOLOR rhs)
{
	B3YXCOLOR v(*this);

	//함수의 바디(Body) 를 완성하십시요..★
	//...
	v.a *= rhs.a;
	v.r *= rhs.r;
	v.g *= rhs.g;
	v.b *= rhs.b;

	// 포화도 제한 (0.0f ~ 1.0f)
	v.a = min(max(v.a, 0.0f), 1.0f);
	v.r = min(max(v.r, 0.0f), 1.0f);
	v.g = min(max(v.g, 0.0f), 1.0f);
	v.b = min(max(v.b, 0.0f), 1.0f);
	return v;
}


//! 색상 스칼라 곱.: ★ 
B3YXCOLOR B3YXCOLOR::operator * (float rhs)
{
	B3YXCOLOR v(*this);

	//함수의 바디(Body) 를 완성하십시요..★
	// 스칼라 곱, 포화도 제한 (0.0f ~ 1.0f)
	v.a = min(max(a * rhs, 0.0f), 1.0f);
	v.r = min(max(r * rhs, 0.0f), 1.0f);
	v.g = min(max(g * rhs, 0.0f), 1.0f);
	v.b = min(max(b * rhs, 0.0f), 1.0f);
	return v;
}

//! 색상 혼합.★
B3YXCOLOR B3YXCOLOR::operator + (B3YXCOLOR rhs)
{
	B3YXCOLOR v(*this);

	//함수의 바디(Body) 를 완성하십시요..★
	//...
	v.a += rhs.a;
	v.r += rhs.r;
	v.g += rhs.g;
	v.b += rhs.b;

	// 포화도 제한 (0.0f ~ 1.0f)
	v.a = min(max(v.a, 0.0f), 1.0f);
	v.r = min(max(v.r, 0.0f), 1.0f);
	v.g = min(max(v.g, 0.0f), 1.0f);
	v.b = min(max(v.b, 0.0f), 1.0f);
	return v;
}

//! 색상 뺄셈.★
B3YXCOLOR B3YXCOLOR::operator - (B3YXCOLOR rhs)
{
	B3YXCOLOR v(*this);

	//함수의 바디(Body) 를 완성하십시요..★
	v.a -= rhs.a;
	v.r -= rhs.r;
	v.g -= rhs.g;
	v.b -= rhs.b;

	// 포화도 제한 (0.0f ~ 1.0f)
	v.a = min(max(v.a, 0.0f), 1.0f);
	v.r = min(max(v.r, 0.0f), 1.0f);
	v.g = min(max(v.g, 0.0f), 1.0f);
	v.b = min(max(v.b, 0.0f), 1.0f);
	return v;
}


//! [ GDI 대응 형변환 ]★
//! float(r, g, b, a) -> DWORD(a, b, g, r) 로 전환. (GDI용) 
// 1, 8, 16, 24
//! Blue 채널이 16번비트..주의.★
//
B3YXCOLOR::operator DWORD ()
{
	COLORREF col = RGB(0, 0, 0);

	//함수의 바디(Body) 를 완성하십시요..★
	//...
	// Red 채널
	DWORD R = (DWORD)(r * 255.0f);
	col |= R;

	 // Green 채널
	DWORD G = (DWORD)(g * 255.0f);
	col |= (G << 8);

	// Blue 채널
	DWORD B = (DWORD)(b * 255.0f);
	col |= (B << 16);

	// Alpha 채널
	DWORD A = (DWORD)(a * 255.0f);
	// col |= (A << 24);
	
	return col;
}



/* [ DX 대응 형변환] <예시> ★
// float(r, g, b, a) -> DWORD(a, r, g, b) 로 전환. (DX용)
// Blue 채널이 0번비트..임에 주의.
//
B3YXCOLOR::operator DWORD ()
{
	DWORD col;
	DWORD B = (DWORD)(b*255.0f);		//여기서 다시 실수형으로 전환.  0~1.0f -> 0~255.0f;
	col =  B ;							//정수형.blue 넣기.  0 ~ 255

	DWORD G = (DWORD)(g*255.0f);
	col |= (G <<8);

	DWORD R = (DWORD)(r*255.0f);
	col |= (R<<16);

	DWORD A = (DWORD)(a/255.0f);
	col |= (A<<24);

	return col;
}
*/






///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
//
// VECTOR2 :  2성분 벡터 연산자 오버로딩  
//
///////////////////////////////////////////////////////////////////////////////

B3YXVECTOR2 B3YXVECTOR2::operator + (B3YXVECTOR2 rhs)
{
	B3YXVECTOR2 v;
	v.x = x + rhs.x;
	v.y = y + rhs.y;

	return v;
}


B3YXVECTOR2 B3YXVECTOR2::operator - (B3YXVECTOR2 rhs)
{
	B3YXVECTOR2 v;
	v.x = x - rhs.x;
	v.y = y - rhs.y;

	return v;
}


B3YVECTOR2 B3YXVECTOR2::operator = (B3YXVECTOR2 rhs)
{
	B3YVECTOR2 v = { x, y };
	return v;
}


B3YXVECTOR2::operator B3YVECTOR2* ()
{
	return (B3YVECTOR2*)this;
}



///////////////////////////////////////////////////////////////////////////////
//
//! 2성분 외적 : 외적의 결과가 양수면, 'CCW' .Back-Face Culling 에 사용.
//!			   : D3DXVec2CCW 대응 (https://learn.microsoft.com/en-us/windows/win32/direct3d9/d3dxvec2ccw)
//!  
//! 2성분으로는 구조적으로 외적이 불가능하므로 3차원으로 확장 사용합니다. 
//!		v0=(x1,y1,0) ⓧ v1=(x2,y2,0). 
//! 또는 아래 수식을 참조하십시오.
//! \code  
//! [3성분 외적] 
//! VECTOR3 v;
//! v.x = v0.y * v1.z - v0.z * v1.y;
//! v.y = v0.z * v1.x - v0.x * v1.z;
//! v.z = v0.x * v1.y - v0.y * v1.x;
//! \endcode
//! 
//
float B3YXVec2CCW(B3YXVECTOR2* v0, B3YXVECTOR2* v1)	
{
	float z = v0->x * v1->y - v0->y * v1->x;
	return z;
}






///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// 
//! ynLerp : 선형보간 : 정수형 
//! 
//! \param[out]	v	보간된 값
//! \param		v0	시작 값
//! \param		v1	끝 값
//! \param		a	보간율 (alpha : 0.0~1.0)
//
void ynLerp(int* v, int v0, int v1, float a)
{
	//if (a < 0) a = 0;	if (a > 1) a = 1;
	a = min(max(a, 0), 1);					//0~1 제한

	*v = (int)((float)v0 * (1 - a) + (float)v1 * (a));
}


/*
///////////////////////////////////////////////////////////////////////////////
//
//! ynLerp 색상 선형보간.
//! DWORD 타입은 연산자 오버로딩 필요.
//!
//! \param[out]	c	보간된 색상
//! \param		c0	시작 색
//! \param		c1	끝 색
//! \param		a	보간율 (alpha : 0.0~1.0)
//
void ynLerp(DWORD* c, DWORD c0, DWORD c1, float a)
{
	//if (a < 0)  a = 0;	if (a > 1) a = 1;
	a = min(max(a, 0), 1);					//0~1 제한

	*c = c0 * (1 - a) + c1 * (a);			//<--경고 발생.. 이 수식이 가능하도록 연산자를 재정의(overloading) 하십시오.
}
*/



////////////////////////////////////////////////////////////////////////////////
//
//! ynLerp 색상 선형보간. ★
//! B3YXCOLOR 타입은 연산자 오버로딩 필요.
//! 
//! \param[out]	c	보간된 색상
//! \param		c0	시작 색
//! \param		c1	끝 색
//! \param		a	보간율 (alpha : 0.0~1.0)
//
void ynLerp(B3YXCOLOR* c, B3YXCOLOR c0, B3YXCOLOR c1, float a)  //★
{
	//if (a < 0) a = 0;	if (a > 1) a = 1;
	a = min(max(a, 0), 1);					//0~1 제한

	*c = c0 * (1 - a) + c1 * (a);			//<--경고 발생.. 이 수식이 가능하도록 연산자를 재정의(overloading) 하십시오.★★★
}




 



/************* end of file "ynMath.cpp" *******************************************/

 